app/controllers/agents_controller.rb

  def index
    @agents = Agent.all
---
SELECT "agents".* FROM "agents"

  def show
    @agent = Agent.find(params[:id])
---
SELECT "agents".* FROM "agents" WHERE "agents"."id" = 5 LIMIT 1

  def edit
    @agent = Agent.find(params[:id])
---
SELECT "agents".* FROM "agents" WHERE "agents"."id" = 10 LIMIT 1

  def create
    @agent = Agent.new(params[:agent])

    respond_to do |format|
      if @agent.save
---
INSERT INTO "agents" ("code_name", "bio", "position", "created_at", "updated_at") VALUES (NULL, NULL, NULL, '2011-06-25 22:41:29.039040', '2011-06-25 22:41:29.039040')

  def update
    @agent = Agent.find(params[:id])

    respond_to do |format|
      if @agent.update_attributes(params[:agent])
---
SELECT "agents".* FROM "agents" WHERE "agents"."id" = 27 LIMIT 1
UPDATE "agents" SET "bio" = 'test', "position" = 'test', "updated_at" = '2011-06-26 11:58:56.272588' WHERE "agents"."id" = 27

  def destroy
    @agent = Agent.find(params[:id])
    @agent.destroy
---
SELECT "agents".* FROM "agents" WHERE "agents"."id" = 1 LIMIT 1
DELETE FROM "agents" WHERE "agents"."id" = 1

  def find
    @matches = Agent.find_by_sql ["SELECT id, code_name FROM agents WHERE code_name = ?", params[:code_name] ]

    @matches.each do | match |
        @agent = Agent.find(match.id)
---
SELECT "agents".* FROM "agents" WHERE "agents"."id" = 0 LIMIT 1